balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18C858.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB2D5" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB2D5" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB2D50" edc:desc="" edc:mask="0x1" edc:name="TXB2D50" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D51" edc:desc="" edc:mask="0x1" edc:name="TXB2D51" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D52" edc:desc="" edc:mask="0x1" edc:name="TXB2D52" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D53" edc:desc="" edc:mask="0x1" edc:name="TXB2D53" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D54" edc:desc="" edc:mask="0x1" edc:name="TXB2D54" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D55" edc:desc="" edc:mask="0x1" edc:name="TXB2D55" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D56" edc:desc="" edc:mask="0x1" edc:name="TXB2D56" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D57" edc:desc="" edc:mask="0x1" edc:name="TXB2D57" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB2D6" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB2D6" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB2D60" edc:desc="" edc:mask="0x1" edc:name="TXB2D60" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D61" edc:desc="" edc:mask="0x1" edc:name="TXB2D61" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D62" edc:desc="" edc:mask="0x1" edc:name="TXB2D62" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D63" edc:desc="" edc:mask="0x1" edc:name="TXB2D63" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D64" edc:desc="" edc:mask="0x1" edc:name="TXB2D64" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D65" edc:desc="" edc:mask="0x1" edc:name="TXB2D65" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D66" edc:desc="" edc:mask="0x1" edc:name="TXB2D66" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D67" edc:desc="" edc:mask="0x1" edc:name="TXB2D67" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB2D7" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB2D7" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB2D70" edc:desc="" edc:mask="0x1" edc:name="TXB2D70" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D71" edc:desc="" edc:mask="0x1" edc:name="TXB2D71" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D72" edc:desc="" edc:mask="0x1" edc:name="TXB2D72" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D73" edc:desc="" edc:mask="0x1" edc:name="TXB2D73" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D74" edc:desc="" edc:mask="0x1" edc:name="TXB2D74" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D75" edc:desc="" edc:mask="0x1" edc:name="TXB2D75" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D76" edc:desc="" edc:mask="0x1" edc:name="TXB2D76" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D77" edc:desc="" edc:mask="0x1" edc:name="TXB2D77" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrr-rrr-" edc:cname="CANSTATRO3" edc:desc="" edc:impl="0xee" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuu-uuu-" edc:name="CANSTATRO3" edc:nzwidth="0x8" edc:por="xxx-xxx-">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="CANSTAT_R04"/>
            <edc:LegacyAlias edc:cname="CANSTAT_RO4"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ICODE0" edc:desc="" edc:mask="0x1" edc:name="ICODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICODE1" edc:desc="" edc:mask="0x1" edc:name="ICODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICODE2" edc:desc="" edc:mask="0x1" edc:name="ICODE2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OPMODE0" edc:desc="" edc:mask="0x1" edc:name="OPMODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPMODE1" edc:desc="" edc:mask="0x1" edc:name="OPMODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPMODE2" edc:desc="" edc:mask="0x1" edc:name="OPMODE2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1"/>
        <edc:SFRDef edc:access="-rrrn-nn" edc:cname="TXB1CON" edc:desc="" edc:impl="0x7b" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuu-uu" edc:name="TXB1CON" edc:nzwidth="0x8" edc:por="-0000-00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXPRI0" edc:desc="" edc:mask="0x1" edc:name="TXPRI0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXPRI1" edc:desc="" edc:mask="0x1" edc:name="TXPRI1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TXREQ" edc:desc="" edc:mask="0x1" edc:name="TXREQ" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXERR" edc:desc="" edc:mask="0x1" edc:name="TXERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXLARB" edc:desc="" edc:mask="0x1" edc:name="TXLARB" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXABT" edc:desc="" edc:mask="0x1" edc:name="TXABT" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
