balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18C858.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXB1SIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB1SIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SID3" edc:desc="" edc:mask="0x1" edc:name="SID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID4" edc:desc="" edc:mask="0x1" edc:name="SID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID5" edc:desc="" edc:mask="0x1" edc:name="SID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID6" edc:desc="" edc:mask="0x1" edc:name="SID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID7" edc:desc="" edc:mask="0x1" edc:name="SID7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID8" edc:desc="" edc:mask="0x1" edc:name="SID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID9" edc:desc="" edc:mask="0x1" edc:name="SID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID10" edc:desc="" edc:mask="0x1" edc:name="SID10" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnn-nn" edc:cname="RXB1SIDL" edc:desc="" edc:impl="0xfb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuu0uu" edc:name="RXB1SIDL" edc:nzwidth="0x8" edc:por="xxxxx0xx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID16" edc:desc="" edc:mask="0x1" edc:name="EID16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID17" edc:desc="" edc:mask="0x1" edc:name="EID17" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EXID" edc:desc="" edc:mask="0x1" edc:name="EXID" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SRR" edc:desc="" edc:mask="0x1" edc:name="SRR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID0" edc:desc="" edc:mask="0x1" edc:name="SID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID1" edc:desc="" edc:mask="0x1" edc:name="SID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID2" edc:desc="" edc:mask="0x1" edc:name="SID2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXB1EIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB1EIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID8" edc:desc="" edc:mask="0x1" edc:name="EID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID9" edc:desc="" edc:mask="0x1" edc:name="EID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID10" edc:desc="" edc:mask="0x1" edc:name="EID10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID11" edc:desc="" edc:mask="0x1" edc:name="EID11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID12" edc:desc="" edc:mask="0x1" edc:name="EID12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID13" edc:desc="" edc:mask="0x1" edc:name="EID13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID14" edc:desc="" edc:mask="0x1" edc:name="EID14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID15" edc:desc="" edc:mask="0x1" edc:name="EID15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXB1EIDL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB1EIDL" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID0" edc:desc="" edc:mask="0x1" edc:name="EID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID1" edc:desc="" edc:mask="0x1" edc:name="EID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID2" edc:desc="" edc:mask="0x1" edc:name="EID2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID3" edc:desc="" edc:mask="0x1" edc:name="EID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID4" edc:desc="" edc:mask="0x1" edc:name="EID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID5" edc:desc="" edc:mask="0x1" edc:name="EID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID6" edc:desc="" edc:mask="0x1" edc:name="EID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID7" edc:desc="" edc:mask="0x1" edc:name="EID7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="RXB1DLC" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0uuuuuuu" edc:name="RXB1DLC" edc:nzwidth="0x8" edc:por="0xxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DLC0" edc:desc="" edc:mask="0x1" edc:name="DLC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLC1" edc:desc="" edc:mask="0x1" edc:name="DLC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLC2" edc:desc="" edc:mask="0x1" edc:name="DLC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLC3" edc:desc="" edc:mask="0x1" edc:name="DLC3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RESB0" edc:desc="" edc:mask="0x1" edc:name="RESB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RESB1" edc:desc="" edc:mask="0x1" edc:name="RESB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXRTR" edc:desc="" edc:mask="0x1" edc:name="RXRTR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="RESBO" edc:desc="" edc:mask="0x1" edc:name="RESBO" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RTR" edc:desc="" edc:mask="0x1" edc:name="RTR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXB1D0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB1D0" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB1D00" edc:desc="" edc:mask="0x1" edc:name="RXB1D00" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D01" edc:desc="" edc:mask="0x1" edc:name="RXB1D01" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D02" edc:desc="" edc:mask="0x1" edc:name="RXB1D02" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D03" edc:desc="" edc:mask="0x1" edc:name="RXB1D03" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D04" edc:desc="" edc:mask="0x1" edc:name="RXB1D04" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D05" edc:desc="" edc:mask="0x1" edc:name="RXB1D05" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D06" edc:desc="" edc:mask="0x1" edc:name="RXB1D06" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D07" edc:desc="" edc:mask="0x1" edc:name="RXB1D07" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXB1D1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB1D1" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB1D10" edc:desc="" edc:mask="0x1" edc:name="RXB1D10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D11" edc:desc="" edc:mask="0x1" edc:name="RXB1D11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D12" edc:desc="" edc:mask="0x1" edc:name="RXB1D12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D13" edc:desc="" edc:mask="0x1" edc:name="RXB1D13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D14" edc:desc="" edc:mask="0x1" edc:name="RXB1D14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D15" edc:desc="" edc:mask="0x1" edc:name="RXB1D15" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D16" edc:desc="" edc:mask="0x1" edc:name="RXB1D16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D17" edc:desc="" edc:mask="0x1" edc:name="RXB1D17" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXB1D2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB1D2" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB1D20" edc:desc="" edc:mask="0x1" edc:name="RXB1D20" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D21" edc:desc="" edc:mask="0x1" edc:name="RXB1D21" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D22" edc:desc="" edc:mask="0x1" edc:name="RXB1D22" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D23" edc:desc="" edc:mask="0x1" edc:name="RXB1D23" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D24" edc:desc="" edc:mask="0x1" edc:name="RXB1D24" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D25" edc:desc="" edc:mask="0x1" edc:name="RXB1D25" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D26" edc:desc="" edc:mask="0x1" edc:name="RXB1D26" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D27" edc:desc="" edc:mask="0x1" edc:name="RXB1D27" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXB1D3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB1D3" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB1D30" edc:desc="" edc:mask="0x1" edc:name="RXB1D30" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D31" edc:desc="" edc:mask="0x1" edc:name="RXB1D31" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D32" edc:desc="" edc:mask="0x1" edc:name="RXB1D32" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D33" edc:desc="" edc:mask="0x1" edc:name="RXB1D33" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D34" edc:desc="" edc:mask="0x1" edc:name="RXB1D34" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D35" edc:desc="" edc:mask="0x1" edc:name="RXB1D35" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D36" edc:desc="" edc:mask="0x1" edc:name="RXB1D36" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D37" edc:desc="" edc:mask="0x1" edc:name="RXB1D37" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXB1D4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB1D4" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB1D40" edc:desc="" edc:mask="0x1" edc:name="RXB1D40" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D41" edc:desc="" edc:mask="0x1" edc:name="RXB1D41" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D42" edc:desc="" edc:mask="0x1" edc:name="RXB1D42" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D43" edc:desc="" edc:mask="0x1" edc:name="RXB1D43" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D44" edc:desc="" edc:mask="0x1" edc:name="RXB1D44" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D45" edc:desc="" edc:mask="0x1" edc:name="RXB1D45" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D46" edc:desc="" edc:mask="0x1" edc:name="RXB1D46" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D47" edc:desc="" edc:mask="0x1" edc:name="RXB1D47" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXB1D5" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB1D5" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB1D50" edc:desc="" edc:mask="0x1" edc:name="RXB1D50" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D51" edc:desc="" edc:mask="0x1" edc:name="RXB1D51" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D52" edc:desc="" edc:mask="0x1" edc:name="RXB1D52" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D53" edc:desc="" edc:mask="0x1" edc:name="RXB1D53" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D54" edc:desc="" edc:mask="0x1" edc:name="RXB1D54" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D55" edc:desc="" edc:mask="0x1" edc:name="RXB1D55" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D56" edc:desc="" edc:mask="0x1" edc:name="RXB1D56" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D57" edc:desc="" edc:mask="0x1" edc:name="RXB1D57" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXB1D6" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB1D6" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB1D60" edc:desc="" edc:mask="0x1" edc:name="RXB1D60" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D61" edc:desc="" edc:mask="0x1" edc:name="RXB1D61" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D62" edc:desc="" edc:mask="0x1" edc:name="RXB1D62" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D63" edc:desc="" edc:mask="0x1" edc:name="RXB1D63" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D64" edc:desc="" edc:mask="0x1" edc:name="RXB1D64" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D65" edc:desc="" edc:mask="0x1" edc:name="RXB1D65" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D66" edc:desc="" edc:mask="0x1" edc:name="RXB1D66" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D67" edc:desc="" edc:mask="0x1" edc:name="RXB1D67" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXB1D7" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB1D7" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB1D70" edc:desc="" edc:mask="0x1" edc:name="RXB1D70" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D71" edc:desc="" edc:mask="0x1" edc:name="RXB1D71" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D72" edc:desc="" edc:mask="0x1" edc:name="RXB1D72" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D73" edc:desc="" edc:mask="0x1" edc:name="RXB1D73" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D74" edc:desc="" edc:mask="0x1" edc:name="RXB1D74" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D75" edc:desc="" edc:mask="0x1" edc:name="RXB1D75" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D76" edc:desc="" edc:mask="0x1" edc:name="RXB1D76" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D77" edc:desc="" edc:mask="0x1" edc:name="RXB1D77" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrr-rrr-" edc:cname="CANSTATRO0" edc:desc="" edc:impl="0xee" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuu-uuu-" edc:name="CANSTATRO0" edc:nzwidth="0x8" edc:por="xxx-xxx-">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="CANSTAT_R01"/>
            <edc:LegacyAlias edc:cname="CANSTAT_RO1"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ICODE0" edc:desc="" edc:mask="0x1" edc:name="ICODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICODE1" edc:desc="" edc:mask="0x1" edc:name="ICODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICODE2" edc:desc="" edc:mask="0x1" edc:name="ICODE2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OPMODE0" edc:desc="" edc:mask="0x1" edc:name="OPMODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPMODE1" edc:desc="" edc:mask="0x1" edc:name="OPMODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPMODE2" edc:desc="" edc:mask="0x1" edc:name="OPMODE2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="0xf" edc:beginaddr="0xf60" edc:endaddr="0x1000" edc:regionid="accesssfr">
        <edc:SFRDef edc:access="cnn-rnrn" edc:cname="RXB0CON" edc:desc="" edc:impl="0xef" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-0000" edc:name="RXB0CON" edc:nzwidth="0x8" edc:por="000-0000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FILHIT0" edc:desc="" edc:mask="0x1" edc:name="FILHIT0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="JTOFF" edc:desc="" edc:mask="0x1" edc:name="JTOFF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0DBEN" edc:desc="" edc:mask="0x1" edc:name="RXB0DBEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXRTRRO" edc:desc="" edc:mask="0x1" edc:name="RXRTRRO" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RXM0" edc:desc="" edc:mask="0x1" edc:name="RXM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXM1" edc:desc="" edc:mask="0x1" edc:name="RXM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXFUL" edc:desc="" edc:mask="0x1" edc:name="RXFUL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RX0DBEN" edc:desc="" edc:mask="0x1" edc:name="RX0DBEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXB0SIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB0SIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SID3" edc:desc="" edc:mask="0x1" edc:name="SID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID4" edc:desc="" edc:mask="0x1" edc:name="SID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID5" edc:desc="" edc:mask="0x1" edc:name="SID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID6" edc:desc="" edc:mask="0x1" edc:name="SID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID7" edc:desc="" edc:mask="0x1" edc:name="SID7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID8" edc:desc="" edc:mask="0x1" edc:name="SID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID9" edc:desc="" edc:mask="0x1" edc:name="SID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID10" edc:desc="" edc:mask="0x1" edc:name="SID10" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
