balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18C858.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXB0D7" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB0D7" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB0D70" edc:desc="" edc:mask="0x1" edc:name="RXB0D70" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D71" edc:desc="" edc:mask="0x1" edc:name="RXB0D71" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D72" edc:desc="" edc:mask="0x1" edc:name="RXB0D72" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D73" edc:desc="" edc:mask="0x1" edc:name="RXB0D73" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D74" edc:desc="" edc:mask="0x1" edc:name="RXB0D74" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D75" edc:desc="" edc:mask="0x1" edc:name="RXB0D75" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D76" edc:desc="" edc:mask="0x1" edc:name="RXB0D76" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D77" edc:desc="" edc:mask="0x1" edc:name="RXB0D77" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RB0D70" edc:desc="" edc:mask="0x1" edc:name="RB0D70" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB0D71" edc:desc="" edc:mask="0x1" edc:name="RB0D71" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB0D72" edc:desc="" edc:mask="0x1" edc:name="RB0D72" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB0D73" edc:desc="" edc:mask="0x1" edc:name="RB0D73" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB0D74" edc:desc="" edc:mask="0x1" edc:name="RB0D74" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB0D75" edc:desc="" edc:mask="0x1" edc:name="RB0D75" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB0D76" edc:desc="" edc:mask="0x1" edc:name="RB0D76" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB0D77" edc:desc="" edc:mask="0x1" edc:name="RB0D77" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrr-rrr-" edc:cname="CANSTAT" edc:desc="" edc:impl="0xee" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuu-" edc:name="CANSTAT" edc:nzwidth="0x8" edc:por="xxxxxxx-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ICODE0" edc:desc="" edc:mask="0x1" edc:name="ICODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICODE1" edc:desc="" edc:mask="0x1" edc:name="ICODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICODE2" edc:desc="" edc:mask="0x1" edc:name="ICODE2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OPMODE0" edc:desc="" edc:mask="0x1" edc:name="OPMODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPMODE1" edc:desc="" edc:mask="0x1" edc:name="OPMODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPMODE2" edc:desc="" edc:mask="0x1" edc:name="OPMODE2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ICOED0" edc:desc="" edc:mask="0x1" edc:name="ICOED0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnn-" edc:cname="CANCON" edc:desc="" edc:impl="0xfe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuu-" edc:name="CANCON" edc:nzwidth="0x8" edc:por="xxxxxxx-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="WIN0" edc:desc="" edc:mask="0x1" edc:name="WIN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN1" edc:desc="" edc:mask="0x1" edc:name="WIN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN2" edc:desc="" edc:mask="0x1" edc:name="WIN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ABAT" edc:desc="" edc:mask="0x1" edc:name="ABAT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="REQOP0" edc:desc="" edc:mask="0x1" edc:name="REQOP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="REQOP1" edc:desc="" edc:mask="0x1" edc:name="REQOP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="REQOP2" edc:desc="" edc:mask="0x1" edc:name="REQOP2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="BRGCON1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="BRGCON1" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BRP0" edc:desc="" edc:mask="0x1" edc:name="BRP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BRP1" edc:desc="" edc:mask="0x1" edc:name="BRP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BRP2" edc:desc="" edc:mask="0x1" edc:name="BRP2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BRP3" edc:desc="" edc:mask="0x1" edc:name="BRP3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BRP4" edc:desc="" edc:mask="0x1" edc:name="BRP4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BRP5" edc:desc="" edc:mask="0x1" edc:name="BRP5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SJW0" edc:desc="" edc:mask="0x1" edc:name="SJW0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SJW1" edc:desc="" edc:mask="0x1" edc:name="SJW1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
